erp3l/src/Enums/ГруппировкиЗатратВЗаказеПереработчику/ГруппировкиЗатратВЗаказеПереработчику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ГруппировкиЗатратВЗаказеПереработчику</name>
  <enumValues>
    <name>БезГруппировки</name>
  </enumValues>
  <enumValues>
    <name>ПоПродукции</name>
  </enumValues>
  <enumValues>
    <name>ПоСпецификациям</name>
  </enumValues>
  <enumValues>
    <name>ПоЗаказамНаПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПоЭтапамПроизводства</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Enums/ГруппировкиЗатратВЗаказеПереработчику/ManagerModule.bsl
// Добавляет в переданный параметр значения перечисление "Группировки затрат в заказе переработчику"
//
// Параметры:
//  ДанныеВыбора - СписокЗначений, Массив - коллекция, в которую добавляются значения перечисление
//
Процедура ЗаполнитьДанныеВыбора(ДанныеВыбора) Экспорт
	
	ДанныеВыбора.Добавить(Перечисления.ГруппировкиЗатратВЗаказеПереработчику.БезГруппировки);
	ДанныеВыбора.Добавить(Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоПродукции);
	ДанныеВыбора.Добавить(Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоСпецификациям);
	//++ Устарело_Производство21
	ДанныеВыбора.Добавить(Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоЗаказамНаПроизводство);
	//-- Устарело_Производство21
	ДанныеВыбора.Добавить(Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства);
	
КонецПроцедуры
